In [10]:
import pandas as pd

print(pd.__version__)

1.3.1

# Persiapan Data Frame

In [11]:
data = {'nama': ['Didi Kempot', 'Glenn Fredly', 'Mbah Surip'],
       'tempat_kelahiran': ['Surakrta, Jawa Tengah', 'Jakarta, Dki Jakarta', 'Mojokerto, Jawa Timur']}

df = pd.DataFrame(data)
df

           nama       tempat_kelahiran
0   Didi Kempot  Surakrta, Jawa Tengah
1  Glenn Fredly   Jakarta, Dki Jakarta
2    Mbah Surip  Mojokerto, Jawa Timur

# Memecah nama depan dan nama belakang

In [12]:
df[['nama_depan', 'nama_belakang']] = df['nama'].str.split(' ', expand=True)
df

           nama       tempat_kelahiran nama_depan nama_belakang
0   Didi Kempot  Surakrta, Jawa Tengah       Didi        Kempot
1  Glenn Fredly   Jakarta, Dki Jakarta      Glenn        Fredly
2    Mbah Surip  Mojokerto, Jawa Timur       Mbah         Surip

# Memecah nama kota dan provinsi

In [13]:
df[['kota', 'provinsi']] = df['tempat_kelahiran'].str.split(',', expand=True)
df

,nama,tempat_kelahiran,nama_depan,nama_belakang,kota,provinsi
0,Didi Kempot,"Surakrta, Jawa Tengah",Didi,Kempot,Surakrta,Jawa Tengah
1,Glenn Fredly,"Jakarta, Dki Jakarta",Glenn,Fredly,Jakarta,Dki Jakarta
2,Mbah Surip,"Mojokerto, Jawa Timur",Mbah,Surip,Mojokerto,Jawa Timur